AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510_nemagfx/nema_dc_hal.c
/*******************************************************************************
 * Copyright (c) 2022 Think Silicon S.A.
 *
   Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this header file and/or associated documentation files to use, copy,
 * modify, merge, publish, distribute, sublicense, and/or sell copies of the
 * Materials, and to permit persons to whom the Materials are furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Materials.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  The software is provided 'as is', without warranty of any kind, express or
 *  implied, including but not limited to the warranties of merchantability,
 *  fitness for a particular purpose and noninfringement. In no event shall
 *  Think Silicon S.A. be liable for any claim, damages or other liability, whether
 *  in an action of contract, tort or otherwise, arising from, out of or in
 *  connection with the software or the use or other dealings in the software.
 ******************************************************************************/

#include "stdint.h"
#include "nema_dc_regs.h"
#include "nema_dc_hal.h"
#include "nema_dc_mipi.h"
#include "nema_dc_intern.h"
#include "nema_dc.h"
#include "nema_dc_dsi.h"
#include "nema_ringbuffer.h"
#include "nema_sys_defs.h"
#include "am_mcu_apollo.h"
#include "nema_dc_jdi.h"
#include "nema_math.h"

#ifdef BAREMETAL

#  ifndef WAIT_IRQ_POLL
#    define WAIT_IRQ_POLL              1
#  endif

#  ifdef WAIT_IRQ_BINARY_SEMAPHORE
#    warning semaphore will not work under baremetal
#    undef WAIT_IRQ_BINARY_SEMAPHORE
#    define WAIT_IRQ_BINARY_SEMAPHORE  0
#  else
#   define WAIT_IRQ_BINARY_SEMAPHORE  0
#  endif

#else  // BAREMETAL

#  ifdef SYSTEM_VIEW
#    include "SEGGER_SYSVIEW_FreeRTOS.h"
#  endif

#  include "FreeRTOS.h"
#  include "task.h"

#  ifndef WAIT_IRQ_POLL
#    define WAIT_IRQ_POLL              0
#  endif

#  ifndef WAIT_IRQ_BINARY_SEMAPHORE
#    define WAIT_IRQ_BINARY_SEMAPHORE  1
#  endif

#  if WAIT_IRQ_BINARY_SEMAPHORE
#    include "semphr.h"
     static SemaphoreHandle_t xSemaphore_vsync = NULL;
     static SemaphoreHandle_t xSemaphore_TE = NULL;
#  endif

#endif // BAREMETAL

#ifndef NEMADC_BASEADDR

#include "apollo510.h"
#define NEMADC_BASEADDR       DC_BASE
#endif

// IRQ number
#ifndef NEMADC_IRQ
#define NEMADC_IRQ           ((IRQn_Type)29U)
#endif

static uintptr_t nemadc_regs = 0;

//
// declaration of display controller interrupt callback function.
//

nema_dc_interrupt_callback  nemadc_te_cb = NULL;
nema_dc_interrupt_callback  nemadc_vsync_cb = NULL;
static void* vsync_arg;
static bool bNeedLaunchInTe = false;
//
// The structure for MiP interface
//
static MiP_display_config_t sMiPConfig = {0};
static float fFormatPeriod = 0;

//
// The arrays for restoring configuration
//
static uint32_t ui32DCRegBlock0[12];    // offset from 0x00 to 0x2C
static uint32_t ui32DCRegBlock1[4];     // offset from 0x1A0 to 0x1AC
static bool bDCRegBackup = false;
//*****************************************************************************
//
//! @brief Backup the key registers
//!
//! @return None.
//
//*****************************************************************************
void
nemadc_backup_registers(void)
{
    ui32DCRegBlock0[NEMADC_REG_MODE/4]          = nemadc_reg_read(NEMADC_REG_MODE);
    ui32DCRegBlock0[NEMADC_REG_CLKCTRL/4]       = nemadc_reg_read(NEMADC_REG_CLKCTRL);
    ui32DCRegBlock0[NEMADC_REG_BGCOLOR/4]       = nemadc_reg_read(NEMADC_REG_BGCOLOR);

    ui32DCRegBlock0[NEMADC_REG_RESXY/4]         = nemadc_reg_read(NEMADC_REG_RESXY);
    ui32DCRegBlock0[NEMADC_REG_FRONTPORCHXY/4]  = nemadc_reg_read(NEMADC_REG_FRONTPORCHXY);
    ui32DCRegBlock0[NEMADC_REG_BLANKINGXY/4]    = nemadc_reg_read(NEMADC_REG_BLANKINGXY);
    ui32DCRegBlock0[NEMADC_REG_BACKPORCHXY/4]   = nemadc_reg_read(NEMADC_REG_BACKPORCHXY);
    ui32DCRegBlock0[NEMADC_REG_STARTXY/4]       = nemadc_reg_read(NEMADC_REG_STARTXY);

    ui32DCRegBlock0[NEMADC_REG_INTERFACE_CFG/4] = nemadc_reg_read(NEMADC_REG_INTERFACE_CFG);
    ui32DCRegBlock0[NEMADC_REG_GPIO/4]          = nemadc_reg_read(NEMADC_REG_GPIO);

    ui32DCRegBlock1[0] = nemadc_reg_read(NEMADC_REG_FORMAT_CTRL);
    ui32DCRegBlock1[1] = nemadc_reg_read(NEMADC_REG_FORMAT_CTRL2);
    ui32DCRegBlock1[2] = nemadc_reg_read(NEMADC_REG_CLKCTRL_CG);
    ui32DCRegBlock1[3] = nemadc_reg_read(NEMADC_REG_FORMAT_CTRL3);
    bDCRegBackup = true;
}
//*****************************************************************************
//
//! @brief Restore the registers after power up
//!
//! this function should be called after nemadc_init() to restore the original
//! configuration.
//!
//! @return true if the registers have been backup,otherwise return false.
//
//*****************************************************************************
bool
nemadc_restore_registers(void)
{
    int resx, fpx, blx, bpx, resy, fpy, bly, bpy;

    if (!bDCRegBackup)
    {
        return false;
    }

    resx = ui32DCRegBlock0[NEMADC_REG_RESXY/4] >> 16;
    resy = ui32DCRegBlock0[NEMADC_REG_RESXY/4] & 0xFFFF;
    fpx = ui32DCRegBlock0[NEMADC_REG_FRONTPORCHXY/4] >> 16;
    fpy = ui32DCRegBlock0[NEMADC_REG_FRONTPORCHXY/4] & 0xFFFF;
    blx = ui32DCRegBlock0[NEMADC_REG_BLANKINGXY/4] >> 16;
    bly = ui32DCRegBlock0[NEMADC_REG_BLANKINGXY/4] & 0xFFFF;
    bpx = ui32DCRegBlock0[NEMADC_REG_BACKPORCHXY/4] >> 16;
    bpy = ui32DCRegBlock0[NEMADC_REG_BACKPORCHXY/4] & 0xFFFF;
    bpx -= blx;
    bpy -= bly;
    blx -= fpx;
    bly -= fpy;
    fpx -= resx;
    fpy -= resy;

    //
    // An internal used struct will be initialized in function nemadc_timing(), so we have to call this function instead of resoring related registers directly.
    //
    nemadc_timing(resx, fpx, blx, bpx, resy, fpy, bly, bpy);

    nemadc_reg_write(NEMADC_REG_MODE, ui32DCRegBlock0[NEMADC_REG_MODE/4]);
    nemadc_reg_write(NEMADC_REG_CLKCTRL, ui32DCRegBlock0[NEMADC_REG_CLKCTRL/4]);
    nemadc_reg_write(NEMADC_REG_BGCOLOR, ui32DCRegBlock0[NEMADC_REG_BGCOLOR/4]);
    nemadc_reg_write(NEMADC_REG_INTERFACE_CFG, ui32DCRegBlock0[NEMADC_REG_INTERFACE_CFG/4]);
    nemadc_reg_write(NEMADC_REG_GPIO, ui32DCRegBlock0[NEMADC_REG_GPIO/4]);

    nemadc_reg_write(NEMADC_REG_FORMAT_CTRL, ui32DCRegBlock1[0]);
    nemadc_reg_write(NEMADC_REG_FORMAT_CTRL2, ui32DCRegBlock1[1]);
    nemadc_reg_write(NEMADC_REG_FORMAT_CTRL3, ui32DCRegBlock1[3]);
    nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, ui32DCRegBlock1[2]);

