AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510_nemagfx/nema_dc_hal.c
}

//*****************************************************************************
//
//! @brief  DBI write
//!
//! @param  ui8Cmd        - command
//! @param  pui8Para      - pointer of parameters to be sent
//! @param  ui8ParaLen    - length of parameters to be sent
//!
//! This function sends DBI commands to panel.
//!
//! @return AM_HAL_STATUS_SUCCESS.
//
//****************************************************************************
static uint32_t
dbi_write(uint8_t ui8Cmd, uint8_t *pui8Para, uint8_t ui8ParaLen)
{
    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_FRC_CSX_0);
    //
    // the maximum length of write is 8 bytes.(1 command + 7 parameters)
    //
    if (ui8ParaLen > 7)
    {
        ui8ParaLen = 7;
    }
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }
    nemadc_MIPI_out(NemaDC_DBI_cmd | NemaDC_wcmd24 | (ui8Cmd << 8));
    for (uint8_t ui8Index = 0; ui8Index < ui8ParaLen; ui8Index++)
    {
        nemadc_MIPI_out(pui8Para[ui8Index]);
    }
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }
    nemadc_MIPI_CFG_out(ui32Cfg);
    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief  DBI read
//!
//! @param  ui8Cmd        - command
//! @param  ui8ParaLen    - length of parameters to be read
//! @param  ui32Received  - received data.
//!
//! This function sends DBI commands to panel.
//!
//! @return AM_HAL_STATUS_SUCCESS.
//
//****************************************************************************
static uint32_t
dbi_read(uint8_t ui8Cmd, uint8_t ui8ParaLen, uint32_t *ui32Received)
{
    uint32_t ui32Mask = 0;

    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    //
    // Force Chip Select line low.
    //
    nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_FRC_CSX_0);
    //
    // the maximum length of this kind of read is 4 bytes.
    //
    if (ui8ParaLen > 4)
    {
        ui8ParaLen = 4;
    }

    //
    // Send read command
    //
    nemadc_MIPI_cmd(NemaDC_wcmd24 | (ui8Cmd << 8));
    //
    // wait NemaDC to become idle
    //
    while ((nemadc_reg_read(NEMADC_REG_STATUS) & DC_STATUS_dbi_pending_trans)!=0);
    //
    // trigger dbi-read operation for 8bits,first 8bits is invalid data
    //
    nemadc_reg_write(NEMADC_REG_DBIB_RDAT, (0x0 << 30));

    while (ui8ParaLen-- != 0)
    {
        //
        // trigger dbi-read operation for 8bits
        //
        nemadc_reg_write(NEMADC_REG_DBIB_RDAT, (0x0 << 30));
        ui32Mask <<= 8;
        ui32Mask |= 0xFF;
    }

    //
    // wait NemaDC to become idle
    //
    while ((nemadc_reg_read(NEMADC_REG_STATUS) & DC_STATUS_dbi_pending_trans)!=0);
    nemadc_MIPI_CFG_out(ui32Cfg);

    *ui32Received = nemadc_reg_read(NEMADC_REG_DBIB_RDAT) & ui32Mask;

    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief DBI-B interface read the frame buffer
//!
//! @param ui8ReceiveBuffer     - pointer of receive buffer
//! @param ui32ParaLen          - the read count
//!
//! @note During a read cycle the host processor reads data from the display module
//! via the interface. The Type B interface utilizes D/CX, RDX and WRX signals as
//! well as all eight (D[7:0]) information signals.RDX is driven from high to low
//! then allowed to be pulled back to high during the read cycle. The display module
//! provides information to the host processor during the read cycle while the host
//! processor reads the display module information on the rising edge of RDX. D/CX
//! is driven high during the read cycle.
//!
//! @return pointer.
//
//*****************************************************************************
void
dbi_frame_read(uint8_t *ui8ReceiveBuffer, uint32_t ui32ParaLen)
{

    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    //
    // Force Chip Select line low.
    //
    nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_FRC_CSX_0);
    //
    // Send command to read memory.
    //
    nemadc_MIPI_cmd(NemaDC_wcmd24 | (MIPI_read_memory_start << 8));

    while ((nemadc_reg_read(NEMADC_REG_STATUS) & DC_STATUS_dbi_pending_trans)!=0);

    for (uint32_t index = 0; index < ui32ParaLen; index++)
    {
        //
        // trigger dbi-read operation for 8bits
        //
        nemadc_reg_write(NEMADC_REG_DBIB_RDAT, (0x0 << 30));

        while ((nemadc_reg_read(NEMADC_REG_STATUS) & DC_STATUS_dbi_pending_trans)!=0);

        ui8ReceiveBuffer[index] = (uint8_t)(nemadc_reg_read(NEMADC_REG_DBIB_RDAT) & 0xff);
    }

    nemadc_MIPI_CFG_out(ui32Cfg);
}

//*****************************************************************************
//
//! @brief  Send DSI DCS(Display Command Set) write commands
//!
//! @param  ui8Cmd        - command
//! @param  pui8Para      - pointer of parameters to be sent
//! @param  ui8ParaLen    - length of parameters to be sent
//! @param  bHS           - high speed mode or low power mode (escape mode)
//!
//! This function sends DSI DCS commands.
//!
//! @return AM_HAL_STATUS_SUCCESS or AM_HAL_STATUS_TIMEOUT.
//
//****************************************************************************
static uint32_t
dsi_dcs_write(uint8_t ui8Cmd, uint8_t* pui8Para, uint8_t ui8ParaLen, bool bHS)
{
    uint32_t ui32Cfg = 0;

    if (bHS == true) // high speed mode
    {
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) & (~0x1));
    }
    else // low power mode
    {
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) | 0x1);
    }

    nemadc_dsi_ct((uint32_t)0, // Unused parameter
                  (uint32_t)0, // Unused parameter
                   NemaDC_dcs_datacmd);
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }

    //
    // enable command/parameters packing
    //
    ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
    //
    // Download command & parameter to DBI i/f
    //
    nemadc_MIPI_out(NemaDC_DBI_cmd | ui8Cmd);
    for (uint8_t ui8Index = 0; ui8Index < ui8ParaLen; ui8Index++)
    {
        nemadc_MIPI_out(pui8Para[ui8Index]);
    }
    //
    // Send command-parameter packet.
    //
    nemadc_MIPI_CFG_out(ui32Cfg);
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }
    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief  Send DSI generic write command.
//!
//! @param  pui8Para        - pointer of parameters to be sent
//! @param  ui8ParaLen      - length of parameters to be sent,it should be greater than zero.
//! @param  bHS             - high speed mode or low power mode (escape mode)
//!
//! This function sends DSI generic commands.
//!
//! @return AM_HAL_STATUS_SUCCESS or AM_HAL_STATUS_TIMEOUT.
//
//****************************************************************************
static uint32_t
dsi_generic_write(uint8_t* pui8Para, uint8_t ui8ParaLen, bool bHS)
{
    uint32_t ui32Cfg = 0;
    nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) & (~0x6)); // set vc_no to 00.

    if (bHS == true) //high speed mode
    {
        //
        // Transmit in HS mode
        //
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) & (~0x1));
    }
    else // low power mode
    {
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) | 0x1);
    }

    nemadc_dsi_ct((uint32_t)0,  // Unused parameter
                  (uint32_t)0,  // Unused parameter
                   NemaDC_ge_datacmd);
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }

    //
    // enable command/parameters packing
    //
    ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);

    if ( ui8ParaLen < 9 )
    {
        //
        // Disable the overlong write feature when its length is less than 9 bytes.
        //
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) & (~0x08));
        nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
    }
    else
    {
        //
        // Enable the overlong write feature when its length isn't less than 9 bytes.
        //
        nemadc_reg_write(NEMADC_REG_GPIO, nemadc_reg_read(NEMADC_REG_GPIO) | 0x08);
        nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_FRC_CSX_0);
    }

    //
    // Download command & parameter to DBI i/f
    //
    if ( ui8ParaLen == 0 )
    {
        nemadc_MIPI_out(NemaDC_DBI_cmd | 0x00);
    }
    else
    {
        for (uint8_t ui8Index = 0; ui8Index < ui8ParaLen; ui8Index++)
        {
            if ( ui8ParaLen < 3 )
            {
                nemadc_MIPI_out(NemaDC_DBI_cmd | pui8Para[ui8Index]);
            }
            else
            {
                nemadc_MIPI_out(pui8Para[ui8Index]);
            }
        }
    }
    //
    // Send command-parameter packet.
    //
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }

    nemadc_MIPI_CFG_out(ui32Cfg);
    //
    // Return directly if timeout
    //
    if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_busy, 0x0U))
    {
        return AM_HAL_STATUS_TIMEOUT;
    }

