AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510_nemagfx/nema_dc_hal.c
    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief Send SPI4/DSPI/QSPI/DSI command via Display Controller(DC)
//!
//! @param  ui8Command      - command
//! @param  p_ui8Para       - pointer of parameters to be sent
//! @param  ui8ParaLen      - length of parameters to be sent
//! @param  bDCS            - DCS command or generic command
//! @param  bHS             - high speed mode or low power mode (escape mode)
//!
//! This function sends commands to display drive IC.
//!
//! @return AM_HAL_STATUS_SUCCESS or AM_HAL_STATUS_TIMEOUT.
//
//****************************************************************************
uint32_t
nemadc_mipi_cmd_write(uint8_t ui8Command,
                      uint8_t* p_ui8Para,
                      uint8_t ui8ParaLen,
                      bool bDCS,
                      bool bHS)
{
    uint32_t ui32Status = AM_HAL_STATUS_SUCCESS;
    uint32_t ui32Cfg = nemadc_reg_read(NEMADC_REG_DBIB_CFG);
    //
    // Check present interface is DBI/DSI or not.
    //
    if (((ui32Cfg & MIPICFG_DBI_EN) != 0) &&
        ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI | MIPICFG_DSPI_SPIX )) == 0))
    {
        //
        // Bitfields MIPICFG_EXT_CTRL,MIPICFG_BLANKING_EN only configured for the DSI interface.
        //
        if (ui32Cfg & (MIPICFG_EXT_CTRL | MIPICFG_BLANKING_EN))
        {
            if (APOLLO5_B0)
            {
                am_hal_dsi_pre_rw_cmd(bHS);
            }

            if (bDCS)
            {
                ui32Status = dsi_dcs_write(ui8Command, p_ui8Para, ui8ParaLen, bHS);
            }
            else
            {
                ui32Status = dsi_generic_write(p_ui8Para, ui8ParaLen, bHS);
            }

            if (ui32Status == AM_HAL_STATUS_SUCCESS)
            {
                //
                // Wait for the DSI stop state
                //
                ui32Status = am_hal_dsi_wait_stop_state(0);
            }
        }
        else
        {
            ui32Status = dbi_write(ui8Command, p_ui8Para, ui8ParaLen);
        }
    }
    else if ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI)) != 0)
    {
        //
        // SPI4,DSPI and QSPI interfaces.
        //
        uint32_t ui32Cmd = 0;
        //
        // Enable Clock
        //
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_en);
        //
        // Return directly if timeout
        //
        if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd, 0x0U))
        {
            return AM_HAL_STATUS_TIMEOUT;
        }

        if ((ui32Cfg & MIPICFG_QSPI) != 0)
        {
            //
            // QSPI interface.
            //
            nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
            ui32Cmd = MIPI_DBIB_CMD | MIPI_MASK_QSPI;
            nemadc_MIPI_out(ui32Cmd | CMD1_DATA1);
            nemadc_MIPI_out(ui32Cmd | MIPI_CMD24 | (ui8Command << CMD_OFFSET));
            //
            // maximum value of ui8ParaLen isn't greater than 18.
            //
            if (ui8ParaLen > 18)
            {
                ui8ParaLen = 18;
            }
        }
        else
        {
            if ((ui32Cfg & MIPICFG_DSPI) != 0)
            {
                //
                // DSPI interface
                //
                nemadc_MIPI_CFG_out(ui32Cfg & (~MIPICFG_DSPI));
            }
            else
            {
                //
                // SPI4 interface
                //
                nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
            }
            nemadc_MIPI_out(MIPI_DBIB_CMD | ui8Command);
            //
            // maximum value of ui8ParaLen isn't greater than 21.
            //
            if (ui8ParaLen > 21)
            {
                ui8ParaLen = 21;
            }
        }

        for (uint8_t i = 0; i < ui8ParaLen/3*3; i+= 3 )
        {
            nemadc_MIPI_out(ui32Cmd | MIPI_CMD24 | p_ui8Para[i] << 16 | p_ui8Para[i+1] << 8 | p_ui8Para[i+2]);
        }

        if (ui8ParaLen % 3 == 2)
        {
            nemadc_MIPI_out(ui32Cmd | MIPI_CMD16 | p_ui8Para[ui8ParaLen-2] << 8 | p_ui8Para[ui8ParaLen-1]);
        }
        else if (ui8ParaLen % 3 == 1)
        {
            nemadc_MIPI_out(ui32Cmd | p_ui8Para[ui8ParaLen-1]);
        }
        //
        // Return directly if timeout
        //
        if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_pending_cmd, 0x0U))
        {
            return AM_HAL_STATUS_TIMEOUT;
        }
        nemadc_MIPI_CFG_out(ui32Cfg);
    }

    return ui32Status;
}

//*****************************************************************************
//
//! @brief  mask valid bitfields
//!
//! @param  ui8DataLen    - length of data to be read
//!
//! @return uint32_t.
//
//****************************************************************************
static inline uint32_t
mask_valid(uint8_t ui8DataLen)
{
    uint32_t mask = 0;
    switch ( ui8DataLen )
    {
        case 1 :
            mask = 0xff;
            break;
        case 2 :
            mask = 0xffff;
            break;
        case 3 :
            mask = 0xffffff;
            break;
        case 4 :
            mask = 0xffffffff;
            break;
        default :
            mask = 0xff;
            break;
    }
    return mask;
}

//*****************************************************************************
//
//! @brief  Send DSI DCS(Display Command Set) read commands
//!
//! @param  ui8Cmd        - command
//! @param  ui8DataLen    - length of data to be read,it should be greater than zero.
//! @param  ui32Received  - received data.
//! @param  bHS           - high speed mode or low power mode (escape mode)
//!
//! This function sends DSI DCS read commands.
//!
//! @return AM_HAL_STATUS_SUCCESS or AM_HAL_STATUS_TIMEOUT.
//
//****************************************************************************
static uint32_t
dsi_dcs_read(uint8_t ui8Cmd, uint8_t ui8DataLen, uint32_t* ui32Received, bool bHS)
{
    uint32_t ui32Cfg = 0;
    //
    // set return packet size (bytes)
    //
    am_hal_dsi_set_return_size(ui8DataLen, bHS);

