AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510_nemagfx/nema_dc_hal.c
        }
        else
        {
            ui32Status = dbi_read(ui8Command, ui8DataLen, p_ui32Data);
        }
    }
    else if ((ui32Cfg & (MIPICFG_SPI3 | MIPICFG_SPI4 | MIPICFG_DSPI | MIPICFG_QSPI)) != 0)
    {
        //
        // QSPI/DSPI/SPI4 interface.
        //
        uint32_t ui32Cmd = 0;
        //
        // Enable Clock
        //
        nemadc_reg_write(NEMADC_REG_CLKCTRL_CG, NemaDC_clkctrl_cg_clk_en);
        if ((ui32Cfg & MIPICFG_QSPI) != 0)
        {
            //
            // QSPI interface.
            //
            nemadc_MIPI_CFG_out(ui32Cfg | MIPICFG_SPI_HOLD);
            ui32Cmd = MIPI_DBIB_CMD | MIPI_MASK_QSPI;
            nemadc_MIPI_out(ui32Cmd | CMD1_RDAT1);
            nemadc_MIPI_out(ui32Cmd | MIPI_CMD16 | ui8Command);
        }
        else
        {
            if ((ui32Cfg & MIPICFG_DSPI) != 0)
            {
                //
                // DSPI interface
                //
                nemadc_MIPI_CFG_out(ui32Cfg & (~MIPICFG_DSPI));
            }
            else
            {
                //
                // SPI4 interface
                //
                nemadc_MIPI_CFG_out(ui32Cfg);
            }
            ui32Cmd = MIPI_DBIB_CMD | ui8Command;
        }

        if (ui8DataLen == 1)
        {
            nemadc_MIPI_out(ui32Cmd | NemaDC_DBI_read);
        }
        else if (ui8DataLen == 2)
        {
            nemadc_MIPI_out(ui32Cmd | NemaDC_DBI_read | NemaDC_rcmd16);
        }
        else if (ui8DataLen == 3)
        {
            nemadc_MIPI_out(ui32Cmd | NemaDC_DBI_read | NemaDC_rcmd24);
        }
        else
        {
            //
            //Read 33-bit, the first high bit is ignored.
            //
            nemadc_reg_write(NEMADC_REG_FORMAT_CTRL,(32 << 16));
            nemadc_MIPI_out(ui32Cmd | NemaDC_DBI_read | NemaDC_rcmd32);
        }

        if ((ui32Cfg & MIPICFG_QSPI) != 0)
        {
            nemadc_MIPI_CFG_out(ui32Cfg & ~MIPICFG_SPI_HOLD);
        }

        if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_rd_wr_on, DC_STATUS_dbi_rd_wr_on))
        {
            return AM_HAL_STATUS_TIMEOUT;
        }
        //
        // Return directly if timeout
        //
        if (AM_HAL_STATUS_TIMEOUT == wait_dbi_idle(DC_STATUS_dbi_rd_wr_on, 0x0U))
        {
            return AM_HAL_STATUS_TIMEOUT;
        }

        *p_ui32Data = nemadc_reg_read(NEMADC_REG_DBIB_RDAT) & mask_valid(ui8DataLen);
        nemadc_MIPI_CFG_out(ui32Cfg);

    }
    return ui32Status;
}


//*****************************************************************************
//
//! @brief DC's Vsync interrupt handle function
//!
//! @param  pvUnused            - invalid  parameter
//!
//! this function used to clear Vsync interrupt status bit.and execute callback.
//!
//! @return None.
//
//*****************************************************************************
static void
prvVsyncInterruptHandler(void *pvUnused)
{

    /* Clear the interrupt */
    nemadc_reg_write(NEMADC_REG_INTERRUPT, nemadc_reg_read(NEMADC_REG_INTERRUPT) & (~(3UL << 4)));

    //
    // DC workarounds after transfer is finsihed
    //
    nemadc_transfer_frame_end();

    //
    // vsync interrupt callback function
    //
    if (nemadc_vsync_cb != NULL)
    {
        nemadc_vsync_cb(vsync_arg, 0);
    }
    else
    {
#  if WAIT_IRQ_BINARY_SEMAPHORE
        xSemaphoreGiveFromISR(xSemaphore_vsync, NULL);
#  endif
    }
}
//*****************************************************************************
//
//! @brief DC's TE interrupt handle function
//!
//! @param  pvUnused            - invalid  parameter
//!
//! this function used to clear TE interrupt status bit.and execute callback.
//!
//! @return None.
//
//*****************************************************************************
static void
prvTEInterruptHandler(void *pvUnused)
{
    /* Clear the interrupt */
    nemadc_reg_write(NEMADC_REG_INTERRUPT, nemadc_reg_read(NEMADC_REG_INTERRUPT) & (~(1U << 3)));

    if (bNeedLaunchInTe)
    {
        nemadc_transfer_frame_launch();
        bNeedLaunchInTe = false;
    }

    //
    // TE interrupt callback function
    //
    if (nemadc_te_cb != NULL)
    {
        nemadc_te_cb(NULL, 0);
    }
    else
    {
#if WAIT_IRQ_BINARY_SEMAPHORE
        xSemaphoreGiveFromISR(xSemaphore_TE, NULL);
#endif
    }
}

//*****************************************************************************
//
//! @brief Display Controller interrupt service function.
//!
//! this function will be called automatically when DC's interrupt(s) arrived.
//!
//! @return None.
//
//*****************************************************************************
void
am_disp_isr(void)
{
#ifdef SYSTEM_VIEW
        traceISR_ENTER();
#endif
    //
    // spi frame end interrupt or frame end interrupt
    //
    if ((nemadc_reg_read(NEMADC_REG_INTERRUPT) & (3UL << 4)) != 0)
    {
        prvVsyncInterruptHandler(NULL);
    }
    if ((nemadc_reg_read(NEMADC_REG_INTERRUPT) & (1UL << 3)) != 0)
    {
        prvTEInterruptHandler(NULL);
    }

#ifdef SYSTEM_VIEW
    traceISR_EXIT();
#endif
}

//*****************************************************************************
//
//! @brief Display Controller initialize function.
//!
//! @return None.
//
//*****************************************************************************
int32_t
nemadc_sys_init(void)
{
    // xil_printf( "nemadc_sys_init()\r\n" );
    nemadc_regs = (uintptr_t)NEMADC_BASEADDR;

    /* Clear the interrupt */
    nemadc_reg_write(NEMADC_REG_INTERRUPT, 0);

    //
    // Enable TE interruption
    //
    nemadc_reg_write(NEMADC_REG_GPIO, 0x20);

    /* Install Interrupt Handler */
    NVIC_SetPriority(NEMADC_IRQ, AM_IRQ_PRIORITY_DEFAULT);
    NVIC_EnableIRQ(NEMADC_IRQ);

#if WAIT_IRQ_BINARY_SEMAPHORE
    if ((nemadc_vsync_cb == NULL) && (xSemaphore_vsync == NULL))
    {
        xSemaphore_vsync = xSemaphoreCreateBinary();
    }
    if (xSemaphore_TE == NULL)
    {
        xSemaphore_TE = xSemaphoreCreateBinary();
    }
#endif

